mxyxbb/MM32SPIN27_lvglv7_spi_fast_dma_ili9163c_rotaryEnc_example/Include/MM32SPIN2xx_p111.h
#define  COMP_CSR_POL                         ((uint32_t)0x00008000)
#define  COMP_CSR_HYST                        ((uint32_t)0x00030000)
#define  COMP_CSR_HYST_0                      ((uint32_t)0x00010000)
#define  COMP_CSR_HYST_1                      ((uint32_t)0x00020000)
#define  COMP_CSR_OFLT                        ((uint32_t)0x001C0000)
#define  COMP_CSR_OFLT_0                      ((uint32_t)0x00040000)
#define  COMP_CSR_OFLT_1                      ((uint32_t)0x00080000)
#define  COMP_CSR_OFLT_2                      ((uint32_t)0x00100000)
#define  COMP_CSR_OUT                         ((uint32_t)0x40000000)
#define  COMP_CSR_LOCK                        ((uint32_t)0x80000000)

#define  COMP_CSR_MODE                        ((uint32_t)0x0000000C)
#define  COMP_CSR_MODE_0                      ((uint32_t)0x00000004)
#define  COMP_CSR_MODE_1                      ((uint32_t)0x00000008)

#define  COMP_CSR_INM_SEL                     ((uint32_t)0x00000070)
#define  COMP_CSR_INM_SEL_0                   ((uint32_t)0x00000010)
#define  COMP_CSR_INM_SEL_1                   ((uint32_t)0x00000020)
#define  COMP_CSR_INM_SEL_2                   ((uint32_t)0x00000040)

#define  COMP_CSR_INP_SEL                     ((uint32_t)0x00000380)
#define  COMP_CSR_INP_SEL_0                   ((uint32_t)0x00000080)
#define  COMP_CSR_INP_SEL_1                   ((uint32_t)0x00000100)
#define  COMP_CSR_INP_SEL_2                   ((uint32_t)0x00000200)

/*******************  Bit definition for COMP_CRV register  *******************/
#define  COMP_CRV_SEL                         ((uint32_t)0x0000000F)
#define  COMP_CRV_SEL_0                       ((uint32_t)0x00000001)
#define  COMP_CRV_SEL_1                       ((uint32_t)0x00000002)
#define  COMP_CRV_SEL_2                       ((uint32_t)0x00000004)
#define  COMP_CRV_SEL_3                       ((uint32_t)0x00000008)

#define  COMP_CRV_EN                          ((uint32_t)0x00000010)
#define  COMP_CRV_SRC                         ((uint32_t)0x00000020)

/*******************  Bit definition for COMP_POLL register  *******************/
#define  COMP_POLL_EN                         ((uint32_t)0x00000001)
#define  COMP_POLL_CH                         ((uint32_t)0x00000002)
#define  COMP_POLL_FIXN                       ((uint32_t)0x00000004)

#define  COMP_POLL_PERIOD                     ((uint32_t)0x00000070)
#define  COMP_POLL_PERIOD_0                   ((uint32_t)0x00000010)
#define  COMP_POLL_PERIOD_1                   ((uint32_t)0x00000020)
#define  COMP_POLL_PERIOD_2                   ((uint32_t)0x00000040)

#define  COMP_POLL_POUT                       ((uint32_t)0x00000700)
#define  COMP_POLL_POUT_0                     ((uint32_t)0x00000100)
#define  COMP_POLL_POUT_1                     ((uint32_t)0x00000200)
#define  COMP_POLL_POUT_2                     ((uint32_t)0x00000400)

/*******************  Bit definition for OPAMP_CSR register  *******************/
#define OPAMP_CSR_OP1_Pos           (0)
#define OPAMP_CSR_OP1               (0x01U << OPAMP_CSR_OP1_Pos)            ///< operational amplifier one enable

#define OPAMP_CSR_OP2_Pos           (8)
#define OPAMP_CSR_OP2               (0x01U << OPAMP_CSR_OP2_Pos)            ///< operational amplifier two enable

#define OPAMP_CSR_OP3_Pos           (16)
#define OPAMP_CSR_OP3               (0x01U << OPAMP_CSR_OP3_Pos)            ///< operational amplifier three enable

#define OPAMP_CSR_OP4_Pos           (24)
#define OPAMP_CSR_OP4               (0x01U << OPAMP_CSR_OP4_Pos)            ///< operational amplifier four enable


#define  OPAMP_CSR_OPAMP1EN                   ( OPAMP_CSR_OP1)
#define  OPAMP_CSR_OPAMP2EN                   ( OPAMP_CSR_OP2)
#define  OPAMP_CSR_OPAMP3EN                   ( OPAMP_CSR_OP3)
#define  OPAMP_CSR_OPAMP4EN                   ( OPAMP_CSR_OP4)


/******************************************************************************/
/*                                                                            */
/*                               Timers (TIM)                                 */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for TIM_CR1 register  ********************/
#define  TIM_CR1_CEN                         ((uint16_t)0x0001)            /*!<Counter enable */
#define  TIM_CR1_UDIS                        ((uint16_t)0x0002)            /*!<Update disable */
#define  TIM_CR1_URS                         ((uint16_t)0x0004)            /*!<Update request source */
#define  TIM_CR1_OPM                         ((uint16_t)0x0008)            /*!<One pulse mode */
#define  TIM_CR1_DIR                         ((uint16_t)0x0010)            /*!<Direction */

#define  TIM_CR1_CMS                         ((uint16_t)0x0060)            /*!<CMS[1:0] bits (Center-aligned mode selection) */
#define  TIM_CR1_CMS_0                       ((uint16_t)0x0020)            /*!<Bit 0 */
#define  TIM_CR1_CMS_1                       ((uint16_t)0x0040)            /*!<Bit 1 */

#define  TIM_CR1_ARPE                        ((uint16_t)0x0080)            /*!<Auto-reload preload enable */

#define  TIM_CR1_CKD                         ((uint16_t)0x0300)            /*!<CKD[1:0] bits (clock division) */
#define  TIM_CR1_CKD_0                       ((uint16_t)0x0100)            /*!<Bit 0 */
#define  TIM_CR1_CKD_1                       ((uint16_t)0x0200)            /*!<Bit 1 */

/*******************  Bit definition for TIM_CR2 register  ********************/
#define  TIM_CR2_CCPC                        ((uint16_t)0x0001)            /*!<Capture/Compare Preloaded Control */
#define  TIM_CR2_CCUS                        ((uint16_t)0x0004)            /*!<Capture/Compare Control Update Selection */
#define  TIM_CR2_CCDS                        ((uint16_t)0x0008)            /*!<Capture/Compare DMA Selection */

#define  TIM_CR2_MMS                         ((uint16_t)0x0070)            /*!<MMS[2:0] bits (Master Mode Selection) */
#define  TIM_CR2_MMS_0                       ((uint16_t)0x0010)            /*!<Bit 0 */
#define  TIM_CR2_MMS_1                       ((uint16_t)0x0020)            /*!<Bit 1 */
#define  TIM_CR2_MMS_2                       ((uint16_t)0x0040)            /*!<Bit 2 */

#define  TIM_CR2_TI1S                        ((uint16_t)0x0080)            /*!<TI1 Selection */
#define  TIM_CR2_OIS1                        ((uint16_t)0x0100)            /*!<Output Idle state 1 (OC1 output) */
#define  TIM_CR2_OIS1N                       ((uint16_t)0x0200)            /*!<Output Idle state 1 (OC1N output) */
#define  TIM_CR2_OIS2                        ((uint16_t)0x0400)            /*!<Output Idle state 2 (OC2 output) */
#define  TIM_CR2_OIS2N                       ((uint16_t)0x0800)            /*!<Output Idle state 2 (OC2N output) */
#define  TIM_CR2_OIS3                        ((uint16_t)0x1000)            /*!<Output Idle state 3 (OC3 output) */
#define  TIM_CR2_OIS3N                       ((uint16_t)0x2000)            /*!<Output Idle state 3 (OC3N output) */
#define  TIM_CR2_OIS4                        ((uint16_t)0x4000)            /*!<Output Idle state 4 (OC4 output) */
#define  TIM_CR2_OIS5                        ((uint32_t)0x00010000)        /*!<Output Idle state 5 (OC5 output) */

