mxyxbb/MM32SPIN27_lvglv7_spi_fast_dma_ili9163c_rotaryEnc_example/Include/MM32SPIN2xx_p111.h
/*******************  Bit definition for I2C_DATA_CMD register  ********************/
#define  I2C_DATA_CMD_DAT                                ((uint16_t)0x00FF)
#define  I2C_DATA_CMD_DAT_0                              ((uint16_t)0x0001)
#define  I2C_DATA_CMD_DAT_1                              ((uint16_t)0x0002)
#define  I2C_DATA_CMD_DAT_2                              ((uint16_t)0x0004)
#define  I2C_DATA_CMD_DAT_3                              ((uint16_t)0x0008)
#define  I2C_DATA_CMD_DAT_4                              ((uint16_t)0x0010)
#define  I2C_DATA_CMD_DAT_5                              ((uint16_t)0x0020)
#define  I2C_DATA_CMD_DAT_6                              ((uint16_t)0x0040)
#define  I2C_DATA_CMD_DAT_7                              ((uint16_t)0x0080)

#define  I2C_DATA_CMD_CMD                                ((uint16_t)0x0100)

/*******************  Bit definition for I2C_SS_SCL_HCNT register  ********************/
#define  I2C_SS_SCL_HCNT                                ((uint16_t)0xFFFF)

/*******************  Bit definition for I2C_SS_SCL_LCNT register  ********************/
#define  I2C_SS_SCL_LCNT                                ((uint16_t)0xFFFF)

/*******************  Bit definition for I2C_FS_SCL_HCNT register  ********************/
#define  I2C_FS_SCL_HCNT                                ((uint16_t)0xFFFF)

/*******************  Bit definition for I2C_FS_SCL_LCNT register  ********************/
#define  I2C_FS_SCL_LCNT                                ((uint16_t)0xFFFF)

/*******************  Bit definition for I2C_FS_SCL_HCNT register  ********************/
#define  I2C_HS_SCL_HCNT                                ((uint16_t)0xFFFF)

/*******************  Bit definition for I2C_FS_SCL_LCNT register  ********************/
#define  I2C_HS_SCL_LCNT                                ((uint16_t)0xFFFF)

/*******************  Bit definition for I2C_INTR_STAT register  ********************/
#define  I2C_INTR_STAT_RX_UNDER                         ((uint16_t)0x0001)
#define  I2C_INTR_STAT_RX_OVER                          ((uint16_t)0x0002)
#define  I2C_INTR_STAT_RX_FULL                          ((uint16_t)0x0004)
#define  I2C_INTR_STAT_TX_OVER                          ((uint16_t)0x0008)
#define  I2C_INTR_STAT_TX_EMPTY                         ((uint16_t)0x0010)
#define  I2C_INTR_STAT_RX_REQ                           ((uint16_t)0x0020)
#define  I2C_INTR_STAT_TX_ABRT                          ((uint16_t)0x0040)
#define  I2C_INTR_STAT_RX_DONE                          ((uint16_t)0x0080)
#define  I2C_INTR_STAT_ACTIVITY                         ((uint16_t)0x0100)
#define  I2C_INTR_STAT_STOP_DET                         ((uint16_t)0x0200)
#define  I2C_INTR_STAT_START_DET                        ((uint16_t)0x0400)
#define  I2C_INTR_STAT_GEN_CALL                         ((uint16_t)0x0800)
#define  I2C_INTR_STAT_RESTART_DET                      ((uint16_t)0x1000)
#define  I2C_INTR_STAT_MST_ON_HOLD                      ((uint16_t)0x2000)

/*******************  Bit definition for I2C_INTR_MASK register  ********************/
#define  I2C_INTR_MASK_RX_UNDER                         ((uint16_t)0x0001)
#define  I2C_INTR_MASK_RX_OVER                          ((uint16_t)0x0002)
#define  I2C_INTR_MASK_RX_FULL                          ((uint16_t)0x0004)
#define  I2C_INTR_MASK_TX_OVER                          ((uint16_t)0x0008)
#define  I2C_INTR_MASK_TX_EMPTY                         ((uint16_t)0x0010)
#define  I2C_INTR_MASK_RX_REQ                           ((uint16_t)0x0020)
#define  I2C_INTR_MASK_TX_ABRT                          ((uint16_t)0x0040)
#define  I2C_INTR_MASK_RX_DONE                          ((uint16_t)0x0080)
#define  I2C_INTR_MASK_ACTIVITY                         ((uint16_t)0x0100)
#define  I2C_INTR_MASK_STOP_DET                         ((uint16_t)0x0200)
#define  I2C_INTR_MASK_START_DET                        ((uint16_t)0x0400)
#define  I2C_INTR_MASK_GEN_CALL                         ((uint16_t)0x0800)
#define  I2C_INTR_MASK_RESTART_DET                      ((uint16_t)0x1000)
#define  I2C_INTR_MASK_MST_ON_HOLD                      ((uint16_t)0x2000)

/*******************  Bit definition for I2C_RAW_INTR_STAT register  ********************/
#define  I2C_RAW_INTR_MASK_RX_UNDER                         ((uint16_t)0x0001)
#define  I2C_RAW_INTR_MASK_RX_OVER                          ((uint16_t)0x0002)
#define  I2C_RAW_INTR_MASK_RX_FULL                          ((uint16_t)0x0004)
#define  I2C_RAW_INTR_MASK_TX_OVER                          ((uint16_t)0x0008)
#define  I2C_RAW_INTR_MASK_TX_EMPTY                         ((uint16_t)0x0010)
#define  I2C_RAW_INTR_MASK_RX_REQ                           ((uint16_t)0x0020)
#define  I2C_RAW_INTR_MASK_TX_ABRT                          ((uint16_t)0x0040)
#define  I2C_RAW_INTR_MASK_RX_DONE                          ((uint16_t)0x0080)
#define  I2C_RAW_INTR_MASK_ACTIVITY                         ((uint16_t)0x0100)
#define  I2C_RAW_INTR_MASK_STOP_DET                         ((uint16_t)0x0200)
#define  I2C_RAW_INTR_MASK_START_DET                        ((uint16_t)0x0400)
#define  I2C_RAW_INTR_MASK_GEN_CALL                         ((uint16_t)0x0800)
#define  I2C_RAW_INTR_MASK_RESTART_DET                      ((uint16_t)0x1000)
#define  I2C_RAW_INTR_MASK_MST_ON_HOLD                      ((uint16_t)0x2000)

/*******************  Bit definition for I2C_CLR_INTR register  ********************/
#define  I2C_CLR_INTR                                       ((uint16_t)0x0001)

/*******************  Bit definition for I2C_CLR_RX_UNDER register  ********************/
#define  I2C_CLR_RX_UNDER                                   ((uint16_t)0x0001)

/*******************  Bit definition for I2C_CLR_RX_OVER register  ********************/
#define  I2C_CLR_RX_OVER                                    ((uint16_t)0x0001)

/*******************  Bit definition for I2C_CLR_TX_OVER register  ********************/
#define  I2C_CLR_TX_OVER                                    ((uint16_t)0x0001)

